---
title: "sed command issues after SSD disk swap"
date: 2018-02-27
forum: General Help
---

### Post by nitinmohan on 2018-02-27
I recently swapped my SSD disk to another machine. When Ubuntu 17.10 boots I see this sed command error all over my /var/log/syslog. I am not sure if all of a sudden the sed command is executing as a shell instead of a bash (my $SHELL points to /bin/bash though).

```

Feb 27 12:06:15 nitin NetworkManager[791]: <info>   [1519761975.2390] device added (path:  /sys/devices/virtual/net/br-09148eec599f, iface: br-09148eec599f): no  ifupdown configuration found.
Feb 27 12:06:15 nitin nm-dispatcher[964]: /bin/sed: 3: /bin/sed: Syntax error: "(" unexpected
Feb 27 12:06:15 nitin nm-dispatcher[964]: /bin/sed: 3: /bin/sed: Syntax error: "(" unexpected
Feb  27 12:06:15 nitin NetworkManager[791]: <info>  [1519761975.2494]  device (br-c05be8ae5712): state change: disconnected -> prepare  (reason 'none', internal state 'external')
Feb 27 12:06:15 nitin  NetworkManager[791]: <info>  [1519761975.2503] device  (br-c05be8ae5712): state change: prepare -> config (reason 'none',  internal state 'external')
Feb 27 12:06:15 nitin NetworkManager[791]:  <info>  [1519761975.2516] device (br-c05be8ae5712): state change:  config -> ip-config (reason 'none', internal state 'external')
Feb 27 12:06:15 nitin nm-dispatcher[964]: grep: /etc/resolv.conf: No such file or directory
Feb 27 12:06:15 nitin nm-dispatcher[964]: /bin/sed: 3: /bin/sed: Syntax error: "(" unexpected
Feb 27 12:06:15 nitin nm-dispatcher[964]: message repeated 2 times: [ /bin/sed: 3: /bin/sed: Syntax error: "(" unexpected]
Feb  27 12:06:15 nitin NetworkManager[791]: <info>  [1519761975.2679]  device (br-c05be8ae5712): state change: ip-config -> ip-check (reason  'none', internal state 'external')
Feb 27 12:06:15 nitin  NetworkManager[791]: <info>  [1519761975.2700] device  (br-c05be8ae5712): state change: ip-check -> secondaries (reason  'none', internal state 'external')
Feb 27 12:06:15 nitin nm-dispatcher[964]: /bin/sed: 3: /bin/sed: Syntax error: "(" unexpected

```

This is not exclusive to NetworkManager and also happens with other processes that uses sed
```

Feb 27 12:06:16 nitin /usr/lib/gdm3/gdm-x-session[2152]: /bin/sed: line 3: syntax error near unexpected token `('
Feb 27 12:06:16 nitin /usr/lib/gdm3/gdm-x-session[2152]: /bin/sed: line 3: `拢脟脿%<89>#011镁脫V脜->眉K<92>73w#011脜i[卯脝9|G#034楼<92>^陋炉#013潞#014U鹿#026麓戮u#020脵脧e@6#004贸脠>碌"氓铆L,#017鲁<94>脗<88>掳*g脗<87>BL<90>猫W#011o脭矛wA<9e><88>.脪9<8b>Kh(脼垄脙#0200陆<9e>貌驴路路么楼 脛{盲#002娄每路v铆3-#004脽芦<9f>脣脕 A[毛#010#020K录=驴<90>D脝p露#0259#032卤脡#篓)FD~冒#037潞<9e>P,#033\<9e>酶&a"G脴娄vw脹脿]赂h毛陋氓VV碌枚#014|霉_脩枚潞<j<94>#014Z楼#017##025<86><87>陋<87><92>氓<93>赂陋脕t<99>o<8b>|脮#034##006路=锚<#030脮#013#024#004*#033&-<82>氓陇陆<83>脧炉脢脪.-脥脌酶<99><9d>茅<90>xa脹脩脦麓拢#0209&茫酶<8d>>y鲁芒猫脧#034m{脛P<9a>酶<90><86>1#026脕xz.#032帽#034隆枚霉oA脙潞枚脰麓N]2\<8e>脕|x5脕碌茫#010冒,X煤卤mF每W9<97>楼<k脵!$陆#011陇#030<|SU6脴脰忙L脺脜<86>赂?#035<_脴脠莽@矛td脟<81>L脻<97><9b>娄脙脺[脠麓X<8f>#006炉H氓<8c>p<99>#001脴h忙><93>脢,<85>O<8c>脿脧p<8a>#014脦I<93>R脕jH冒D矛E9w#031脹:赂9帽m{.<89>露脰e<91>脛0<88>V#004拢q#026玫垄#021i#017P<9c><93>脤<84>脕#024<8f>'<98><94>脢V#024i没铆貌#011毛<84>#1!脝pE氓L卯T$<8b>Y冒脹<93><92>m#034|#020k#032#011芦~&谩.脌#006陋#031D脙S<81>hF#030U~#027|猫:2<82>5j#014矛露L没#034#035录#032O脫脷毛脽貌)\+脫#024<9d>镁#024?H每#010t锚#016#032脣0脩篓路脗Rc茫茂\<8e>#D_#015.驴c m~芦#014?<8d>[-<88>K<9b>#017~1J#024酶*kh脙<8b><9f>脗 ;脫6<83>脛<99>&卤毛#003碌潞q+#033露nH氓#023<9b>貌脷b'麓<95>+潞陋#037掳ydu#0224C#024<82>脡#021脰#036G每#004R隆L?+娄*a#005芦X@H脪#033<91>t<81>i露#015#013g脼%zJ脟<90>莽#034S脡N<8e>4毛o露~O:=#034j脨*#017霉篓C<82>'脢脗卤虏脦#002<89><8c><8a>\n6<86>w/Y隆Z%没G{虏庐<84><8c>82'
Feb 27 12:06:16 nitin /usr/lib/gdm3/gdm-x-session[2152]: /bin/sed: line 3: syntax error near unexpected token `('

```

I looked for similar issues in this forum as much as I could but didn't find any. Any help greatly appreciated. Thanks!

---

### Post by nitinmohan on 2018-02-27
I worked around this problem by replacing the sed binary with another. But that doesn't really explain how the system got to this state.

---

### Post by QIII on 2018-02-27
Hello!

Please use code tags (the # button above the text entry box) rather than quote tags to enclose terminal commands and results.

That will make your posts much easier to read.

---

### Post by nitinmohan on 2018-02-27
Thanks for the update and I apologize for the editing. I couldn't find out how to wrap text as code. Now I know.

---

### Post by QIII on 2018-02-27
No problem!  Just making it easier for you to get help.  :)

---

